Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.cognito.aws_lambda_permission.customMessageLambdaTrigger must be replaced
-/+ resource "aws_lambda_permission" "customMessageLambdaTrigger" {
      ~ id                  = "SBeaconBackendAllowCustomMessageLambdaTriggerInvoke" -> (known after apply)
      ~ source_arn          = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_authorizer.pgxflow_user_pool_authorizer will be updated in-place
  ~ resource "aws_api_gateway_authorizer" "pgxflow_user_pool_authorizer" {
        id                               = "1h2hn3"
        name                             = "pgxflow-userpool-authorizer"
      ~ provider_arns                    = [
          - "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "pgxflow-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = "arn:aws:wafv2:us-east-1:438465168484:global/webacl/security-all-cloudfront/12dceed5-0151-4196-bc00-f7f00a739093"

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "66268527-2cd7-4c61-b379-cd7acb8c7009"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = "e394de6d-03ca-444a-973d-11b72fef4a46"
          + target_origin_id         = "pgxflow-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "cy0g8gkrzd.execute-api.ap-southeast-3.amazonaws.com"
          + origin_id                = "pgxflow-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
              + "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-generateCohortVCfs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-generateCohortVCfs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_authorizer.beacon_user_pool_authorizer will be updated in-place
  ~ resource "aws_api_gateway_authorizer" "beacon_user_pool_authorizer" {
        id                               = "25479y"
        name                             = "sbeacon-userpool-authorizer"
      ~ provider_arns                    = [
          - "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "sbeacon-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = "arn:aws:wafv2:us-east-1:438465168484:global/webacl/security-all-cloudfront/12dceed5-0151-4196-bc00-f7f00a739093"

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = "912a7b77-4ac1-4f7e-ab88-7ff43a018f3e"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = "1b51c2ed-6de1-475c-aacd-98cbb77b66f7"
          + target_origin_id         = "sbeacon-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "pe0lv0x63k.execute-api.ap-southeast-3.amazonaws.com"
          + origin_id                = "sbeacon-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20250619023039049500000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = (known after apply)
          + "api_endpoint_sbeacon"    = (known after apply)
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "pgxflow"
          + "data_portal_bucket"      = "gaspi-dataportal-20250619023046541400000001"
          + "hub_name"                = "RSJPD"
          + "identity_pool_id"        = "ap-southeast-3:d08bb77d-5e8b-41ac-9eb6-04a5bdb54be7"
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = (known after apply)
          + "user_pool_web_client_id" = (known after apply)
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be created
  + resource "aws_cloudfront_distribution" "bui-s3-distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Distribution for BeaconUI"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2and3"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + tags_all                        = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = "arn:aws:wafv2:us-east-1:438465168484:global/webacl/security-all-cloudfront/12dceed5-0151-4196-bc00-f7f00a739093"

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = "f208a0c7-1361-4b2f-8f0a-fdc1e09afec8"
          + target_origin_id           = "webgui-s3-origin-id"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "webgui-bucket-20250619023039049500000001.s3.ap-southeast-3.amazonaws.com"
          + origin_access_control_id = "E2P4LP2ML363P4"
          + origin_id                = "webgui-s3-origin-id"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
        id      = "f208a0c7-1361-4b2f-8f0a-fdc1e09afec8"
        name    = "bui-security-headers-policy"
        # (3 unchanged attributes hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d2ho17g62kz49c.cloudfront.net/prod/ https://d1gjgo11mz1ewf.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gaspi-dataportal-20250619023046541400000001.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';" -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be updated in-place
  ~ resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
        id     = "webgui-bucket-20250619023039049500000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::438465168484:distribution/E15N1ZE74H07IO"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::webgui-bucket-20250619023039049500000001/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be updated in-place
  ~ resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
        id              = "bui-ssm-beacon-ui-url"
      + insecure_value  = (known after apply)
        name            = "bui-ssm-beacon-ui-url"
        tags            = {
            "Environment" = "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "806723230776423257" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "1412a25ec309b3f9588bd87d2057a33d3c927bb1" -> (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "6983544010820734442" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "1412a25ec309b3f9588bd87d2057a33d3c927bb1" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object 72e5cd9c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2700050535487884804" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1750300212735586000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FILE_LOCATION"   = "gaspi-dataportal-20250619023046541400000001"
              - "HTS_S3_HOST"     = "s3.ap-southeast-3.amazonaws.com"
              - "RESULT_DURATION" = "86400"
              - "USER_POOL_ID"    = "ap-southeast-3_6zYbxTjuA"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_REGISTRATION_EMAIL_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendRegistrationEmail"
              - "COGNITO_USER_POOL_ID"                 = "ap-southeast-3_6zYbxTjuA"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250619023048449900000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250619023048449900000002"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CLINIC_TEMP_BUCKET_NAMES"             = "pgxflow-backend-20250619023038383000000003"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_MANAGER_GROUP_NAME"           = "managers"
              - "COHORT_MAKER_LAMBDA"                  = "sbeacon-backend-generateCohortVCfs"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_CLINICAL_ANNOTATIONS_TABLE"    = "sbeacon-dataportal-clinical-annotations"
              - "DYNAMO_CLINICAL_VARIANTS_TABLE"       = "sbeacon-dataportal-clinical-variants"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PRICING_CACHE_TABLE"           = "sbeacon-dataportal-pricing-cache"
              - "DYNAMO_PROJECTS_TABLE"                = "sbeacon-dataportal-projects"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "DYNAMO_SAVED_QUERIES_TABLE"           = "sbeacon-dataportal-saved-queries"
              - "HUB_NAME"                             = "RSJPD"
              - "INDEXER_LAMBDA"                       = "sbeacon-backend-indexer"
              - "JUPYTER_INSTACE_ROLE_ARN"             = "arn:aws:iam::438465168484:role/sbeacon_backend_sagemaker_jupyter_instance_role"
              - "JUPYTER_LIFECYCLE_CONFIG_NAME"        = "clone-gaspi-notebooks"
              - "REPORTS_LAMBDA"                       = "sbeacon-backend-generateReports"
              - "SUBMIT_LAMBDA"                        = "sbeacon-backend-submitDataset"
              - "USER_POOL_ID"                         = "ap-southeast-3_6zYbxTjuA"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0"
        name        = "sbeacon-backend-generateCohortVCfs-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              - "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              - "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              - "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              - "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              - "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              - "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              - "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250619023048449900000002"
              - "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              - "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              - "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              - "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              - "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              - "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              - "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              - "ATHENA_WORKGROUP"                     = "query_workgroup"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "COGNITO_USER_POOL_ID"                 = "ap-southeast-3_6zYbxTjuA"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0"
        name        = "pgxflow-backend-lookup-sendJobEmail-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-sendJobEmail"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_6zYbxTjuA"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-pharmcat-sendJobEmail:pgxflow-backend-pharmcat-sendJobEmail-0"
        name        = "pgxflow-backend-pharmcat-sendJobEmail-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:438465168484:userpool/ap-southeast-3_6zYbxTjuA"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-sendJobEmail"
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:438465168484:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_6zYbxTjuA"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 13 to add, 22 to change, 5 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_6zYbxTjuA --region ap-southeast-3 --client-id 4np4n3rvt771kj3ocg18gr2t3v --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin@Example123! --output json --query AuthenticationResult.IdToken" -> (known after apply)
  ~ api_url              = "https://d2ho17g62kz49c.cloudfront.net/prod/" -> (known after apply)
  ~ beacon_ui_url        = "https://d1b0yb8el6vgxd.cloudfront.net" -> (known after apply)
  ~ cognito_client_id    = "4np4n3rvt771kj3ocg18gr2t3v" -> (known after apply)
  ~ cognito_user_pool_id = "ap-southeast-3_6zYbxTjuA" -> (known after apply)
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_6zYbxTjuA --region ap-southeast-3 --client-id 4np4n3rvt771kj3ocg18gr2t3v --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest@Example123! --output json --query AuthenticationResult.IdToken" -> (known after apply)
╷
│ Warning: AWS resource not found during refresh
│ 
│   with module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client,
│   on cognito/cognito.tf line 64, in resource "aws_cognito_user_pool_client" "gaspi_user_pool_client":
│   64: resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
│ 
│ Automatically removing from Terraform State instead of returning the error,
│ which may trigger resource recreation. Original error: couldn't find
│ resource
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/cognito.lambda-customMessageLambdaTrigger/outputs.tf line 9, in output "lambda_function_arn_static":
│    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:${data.aws_partition.current.partition}:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 109 more similar warnings elsewhere)
╵
╷
│ Error: reading Cognito User Pool Client ()
│ 
│   with module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client,
│   on cognito/cognito.tf line 64, in resource "aws_cognito_user_pool_client" "gaspi_user_pool_client":
│   64: resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
│ 
│ operation error Cognito Identity Provider: DescribeUserPoolClient, https
│ response error StatusCode: 400, RequestID:
│ 5c5b84d4-14c3-43b0-9216-1d8700511ea6, InvalidParameterException: 4
│ validation errors detected: Value '' at 'clientId' failed to satisfy
│ constraint: Member must have length greater than or equal to 1; Value '' at
│ 'clientId' failed to satisfy constraint: Member must satisfy regular
│ expression pattern: [\w+]+; Value '' at 'userPoolId' failed to satisfy
│ constraint: Member must have length greater than or equal to 1; Value '' at
│ 'userPoolId' failed to satisfy constraint: Member must satisfy regular
│ expression pattern: [\w-]+_[0-9a-zA-Z]+
╵
❌ Terraform plan creation failed
❌ Terraform plan failed
❌ Main execution failed
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
❌ Script failed with exit code: 1


```
</details>